Revit 2027 API
BuildingPad.AssociatedTopographySurfaceId Property
 The element id of a topography surface created by the introduction of this building pad.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId AssociatedTopographySurfaceId { get; }
Public ReadOnly Property AssociatedTopographySurfaceId As ElementId
	Get
public:
property ElementId^ AssociatedTopographySurfaceId {
	ElementId^ get ();
}
member AssociatedTopographySurfaceId : ElementId with get
Property Value
ElementId
See Also
Reference
BuildingPad Class
Autodesk.Revit.DB.Architecture Namespace